// patterns.ts
'use client';

export const patterns = [
	// T-образная фигура (5 заполненных ячеек)
	[
		[0, 0, 1, 0, 0, 0],
		[0, 1, 1, 1, 0, 0],
		[0, 0, 1, 0, 0, 0],
		[0, 0, 0, 0, 0, 0],
		[0, 0, 0, 0, 0, 0],
		[0, 0, 0, 0, 0, 0]
	],
	// L-образная фигура (5 заполненных ячеек)
	[
		[1, 0, 0, 0, 0, 0],
		[1, 0, 0, 0, 0, 0],
		[1, 0, 0, 0, 0, 0],
		[1, 1, 0, 0, 0, 0],
		[0, 0, 0, 0, 0, 0],
		[0, 0, 0, 0, 0, 0]
	],
	// Г-образная фигура (5 заполненных ячеек)
	[
		[0, 0, 0, 0, 0, 1],
		[0, 0, 0, 0, 0, 1],
		[0, 0, 0, 0, 0, 1],
		[0, 0, 0, 1, 1, 0],
		[0, 0, 0, 0, 0, 0],
		[0, 0, 0, 0, 0, 0]
	],
	// Прямая линия (5 заполненных ячеек)
	[
		[0, 0, 0, 0, 0, 0],
		[0, 1, 1, 1, 1, 1],
		[0, 0, 0, 0, 0, 0],
		[0, 0, 0, 0, 0, 0],
		[0, 0, 0, 0, 0, 0],
		[0, 0, 0, 0, 0, 0]
	]
];

// Перевернутые версии паттернов
export const reversedPatterns = patterns.map(pattern =>
	pattern.map(row => row.slice().reverse())
);
